spec/fixtures/transports.create.xml

<?xml version="1.0" encoding="UTF-8"?>
<transport>
    <id>12544003</id>
    <status>draft</status>
    <archived>false</archived>
    <type>Transport</type>
    <sequence_number>draft</sequence_number>
    <date>17/05/2017</date>
    <due_date>17/05/2017</due_date>
    <reference></reference>
    <observations>Artigo 16&#186; n&#186; 6 do CIVA.</observations>
    <retention></retention>
    <permalink>https://www.app.invoicexpress.com/documents/1254400341c027c8e7d357731cf9adb11998a8816be06393</permalink>
    <address_from>
        <detail>From Address</detail>
        <city>Lisbon</city>
        <postal_code>1300-501</postal_code>
        <country>Portugal</country>
    </address_from>
    <address_to>
        <detail>To Address</detail>
        <city>Lisbon</city>
        <postal_code>1300-501</postal_code>
        <country>Portugal</country>
    </address_to>
    <client>
        <id>1408722</id>
        <name>Peter Parker</name>
        <code>5239</code>
        <email>help@thinkorange.pt</email>
        <address>Some address here</address>
        <city>Lisboa</city>
        <postal_code>1111-501</postal_code>
        <country>Portugal</country>
        <fiscal_id>177142430</fiscal_id>
        <website></website>
        <phone></phone>
        <fax></fax>
    </client>
    <currency>Euro</currency>
    <items type="array">
        <item>
            <name>Item 1</name>
            <description></description>
            <unit_price>60.0</unit_price>
            <unit></unit>
            <quantity>2.0</quantity>
            <tax>
                <id>92081</id>
                <name>Isento</name>
                <value>0.0</value>
            </tax>
            <discount>0.0</discount>
            <subtotal>120.0</subtotal>
            <tax_amount>0.0</tax_amount>
            <discount_amount>0.0</discount_amount>
            <total>120.0</total>
        </item>
        <item>
            <name>Item 2</name>
            <description></description>
            <unit_price>50.0</unit_price>
            <unit></unit>
            <quantity>1.0</quantity>
            <tax>
                <id>92081</id>
                <name>Isento</name>
                <value>0.0</value>
            </tax>
            <discount>0.0</discount>
            <subtotal>50.0</subtotal>
            <tax_amount>0.0</tax_amount>
            <discount_amount>0.0</discount_amount>
            <total>50.0</total>
        </item>
    </items>
    <sum>170.0</sum>
    <discount>0.0</discount>
    <before_taxes>170.0</before_taxes>
    <taxes>0.0</taxes>
    <total>170.0</total>
    <invoice_timeline type="array">
        <event>
            <type>edited</type>
            <date>17/05/2017</date>
            <time>15:23</time>
            <user>business@thinkorange.pt</user>
        </event>
        <event>
            <type>edited</type>
            <date>17/05/2017</date>
            <time>15:23</time>
            <user>business@thinkorange.pt</user>
        </event>
        <event>
            <type>create</type>
            <date>17/05/2017</date>
            <time>15:23</time>
            <user>business@thinkorange.pt</user>
        </event>
    </invoice_timeline>
</transport>
